In [71]:
import pandas as pd

In [72]:
data=pd.read_csv("Titanic+Data+Set (1).csv")

In [73]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,NaN,S

In [74]:
data.isnull().value_counts()

PassengerId  Survived  Pclass  Name   Sex    Age    SibSp  Parch  Fare   Cabin  Embarked
False        False     False   False  False  False  False  False  False  True   False       529
                                                                         False  False       183
                                             True   False  False  False  True   False       158
                                                                         False  False        19
                                             False  False  False  False  False  True          2
dtype: int64

In [75]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# Number of passenger Travled

In [76]:
data .shape

(891, 11)

# Number of Passenger Survived

In [77]:
data["Survived"].value_counts()

0    549
1    342
Name: Survived, dtype: int64

# Number of male passenger and female passenger survived

In [78]:
survived = pd.pivot_table(data, index="Sex", columns="Survived", values="PassengerId", aggfunc="count")

In [79]:
survived

Survived    0    1
Sex
female     81  233
male      468  109

In [80]:
survived1 = pd.pivot_table(data, index=["Pclass","Sex"], columns="Survived", values="PassengerId", aggfunc="count")

In [81]:
survived1

Survived         0   1
Pclass Sex
1      female    3  91
       male     77  45
2      female    6  70
       male     91  17
3      female   72  72
       male    300  47

# data cleaning

In [86]:
data["Age"]=data["Age"].dropna()

In [87]:
data.shape

(891, 11)